// Задача № 11: Показать вторую цифру трехзначного числа.

int number = 462;
int lastnumber = (number/10)%10;
Console.WriteLine(lastnumber);

