// Задача № 4: По заданному номеру дня недели вывести его название

// string [] dayweek = { "пн", "вт", "ср","чт", "пт", "сб", "вс" };

// Console.WriteLine ("Введите от 1 до 7");
// int 

