// See https://aka.ms/new-console-template for more information

// Задача № 6: Написать программу вычисления значения функции y = f(a).

double F(double a)
{
    return a*2;
}
System.Console.WriteLine(F(6));