// Задача № 10: Показать последнюю цифру трехзначного числа.
int number = 462;
int lastnumber = (number % 10);
Console.WriteLine(lastnumber);

