// Задача № 34: Написать программу замену элементов массива на противоположные.

int [] a = {1, 2, -3, 5, -9, 7};
for (int i = 0; i<a.Length; i++)
{ 
    a[i] = a[i] * (-1);   
    Console.Write($"{a[i]},");
} 

